log/benchmark/ruby_2_6_2.log
$ ruby -v
ruby 2.6.2p47 (2019-03-13 revision 67232) [x86_64-linux]

$ bundle exec puma -e production --workers=4 --threads=1 --preload

$ ab -n 10000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        53043 bytes

Concurrency Level:      4
Time taken for tests:   34.664 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      537464130 bytes
HTML transferred:       530430000 bytes
Requests per second:    288.48 [#/sec] (mean)
Time per request:       13.866 [ms] (mean)
Time per request:       3.466 [ms] (mean, across all concurrent requests)
Transfer rate:          15141.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    10   14   4.8     11      85
Waiting:       10   14   4.8     11      85
Total:         10   14   4.8     11      85

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     14
  75%     16
  80%     17
  90%     18
  95%     24
  98%     28
  99%     34
 100%     85 (longest request)

$ ab -n 10000 -c 4 localhost:3000/posts.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts.json
Document Length:        39764 bytes

Concurrency Level:      4
Time taken for tests:   69.283 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      402130000 bytes
HTML transferred:       397640000 bytes
Requests per second:    144.34 [#/sec] (mean)
Time per request:       27.713 [ms] (mean)
Time per request:       6.928 [ms] (mean, across all concurrent requests)
Transfer rate:          5668.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       3
Processing:    21   28   9.7     23     158
Waiting:       20   27   9.7     23     158
Total:         21   28   9.7     23     159

Percentage of the requests served within a certain time (ms)
  50%     23
  66%     29
  75%     29
  80%     30
  90%     36
  95%     47
  98%     62
  99%     69
 100%    159 (longest request)

$ ab -n 10000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        1722 bytes

Concurrency Level:      4
Time taken for tests:   4.807 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      18830000 bytes
HTML transferred:       17220000 bytes
Requests per second:    2080.37 [#/sec] (mean)
Time per request:       1.923 [ms] (mean)
Time per request:       0.481 [ms] (mean, across all concurrent requests)
Transfer rate:          3825.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1    2   1.2      2      33
Waiting:        1    2   1.2      2      33
Total:          1    2   1.2      2      33

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      2
  95%      3
  98%      4
  99%      9
 100%     33 (longest request)

$ ab -n 10000 -c 4 localhost:3000/posts/1.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1.json
Document Length:        34 bytes

Concurrency Level:      4
Time taken for tests:   4.932 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      2000000 bytes
HTML transferred:       340000 bytes
Requests per second:    2027.53 [#/sec] (mean)
Time per request:       1.973 [ms] (mean)
Time per request:       0.493 [ms] (mean, across all concurrent requests)
Transfer rate:          396.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1    2   1.4      2      43
Waiting:        1    2   1.3      2      43
Total:          1    2   1.4      2      44

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      2
  95%      3
  98%      4
  99%      8
 100%     44 (longest request)